# StairsPathFullStepArrow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsPathFullStepArrow Property
ParameterTypeId Class See Also
---
"Full Step Arrow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsPathFullStepArrow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsPathFullStepArrow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsPathFullStepArrow {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace